experiments/workflow/beldi-movie/expected_results/qps100/wrk.log
Running 2m test @ http://ip-172-31-15-142.us-east-2.compute.internal:8080
  2 threads and 2 connections
  Thread calibration: mean lat.: 0.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.342ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.62ms    9.05ms  45.09ms   91.77%
    Req/Sec    51.71     49.32   333.00     44.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.32ms
 90.000%    1.59ms
 99.000%   45.06ms
 99.900%   45.09ms
 99.990%   45.12ms
 99.999%   45.12ms
100.000%   45.12ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.307     0.000000            1         1.00
       0.608     0.100000         1407         1.11
       0.723     0.200000         2810         1.25
       0.843     0.300000         4203         1.43
       0.934     0.400000         5602         1.67
       1.035     0.500000         7000         2.00
       1.091     0.550000         7712         2.22
       1.157     0.600000         8404         2.50
       1.211     0.650000         9116         2.86
       1.262     0.700000         9804         3.33
       1.315     0.750000        10505         4.00
       1.347     0.775000        10864         4.44
       1.379     0.800000        11210         5.00
       1.414     0.825000        11554         5.71
       1.460     0.850000        11903         6.67
       1.517     0.875000        12252         8.00
       1.551     0.887500        12424         8.89
       1.587     0.900000        12601        10.00
       5.563     0.912500        12774        11.43
      21.279     0.925000        12988        13.33
      21.359     0.937500        13150        16.00
      21.391     0.943750        13221        17.78
      25.279     0.950000        13304        20.00
      25.391     0.956250        13393        22.86
      41.055     0.962500        13799        26.67
      41.055     0.968750        13799        32.00
      41.055     0.971875        13799        35.56
      41.055     0.975000        13799        40.00
      41.055     0.978125        13799        45.71
      41.055     0.981250        13799        53.33
      41.055     0.984375        13799        64.00
      41.119     0.985938        13806        71.11
      41.631     0.987500        13832        80.00
      41.695     0.989062        13849        91.43
      45.055     0.990625        13940       106.67
      45.055     0.992188        13940       128.00
      45.055     0.992969        13940       142.22
      45.055     0.993750        13940       160.00
      45.055     0.994531        13940       182.86
      45.055     0.995313        13940       213.33
      45.087     0.996094        13995       256.00
      45.087     0.996484        13995       284.44
      45.087     0.996875        13995       320.00
      45.087     0.997266        13995       365.71
      45.087     0.997656        13995       426.67
      45.087     0.998047        13995       512.00
      45.087     0.998242        13995       568.89
      45.087     0.998437        13995       640.00
      45.087     0.998633        13995       731.43
      45.087     0.998828        13995       853.33
      45.087     0.999023        13995      1024.00
      45.087     0.999121        13995      1137.78
      45.087     0.999219        13995      1280.00
      45.087     0.999316        13995      1462.86
      45.087     0.999414        13995      1706.67
      45.087     0.999512        13995      2048.00
      45.087     0.999561        13995      2275.56
      45.087     0.999609        13995      2560.00
      45.087     0.999658        13995      2925.71
      45.087     0.999707        13995      3413.33
      45.087     0.999756        13995      4096.00
      45.087     0.999780        13995      4551.11
      45.119     0.999805        13998      5120.00
      45.119     1.000000        13998          inf
#[Mean    =        3.616, StdDeviation   =        9.051]
#[Max     =       45.088, Total count    =        13998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  198.00us
 75.000%  254.00us
 90.000%  289.00us
 99.000%   43.81ms
 99.900%   44.00ms
 99.990%   44.80ms
 99.999%   44.80ms
100.000%   44.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.126     0.000000            1         1.00
       0.163     0.100000         1452         1.11
       0.174     0.200000         2894         1.25
       0.182     0.300000         4301         1.43
       0.189     0.400000         5651         1.67
       0.198     0.500000         7054         2.00
       0.206     0.550000         7767         2.22
       0.219     0.600000         8435         2.50
       0.233     0.650000         9117         2.86
       0.244     0.700000         9813         3.33
       0.254     0.750000        10508         4.00
       0.259     0.775000        10854         4.44
       0.264     0.800000        11208         5.00
       0.269     0.825000        11572         5.71
       0.275     0.850000        11937         6.67
       0.281     0.875000        12261         8.00
       0.285     0.887500        12453         8.89
       0.289     0.900000        12630        10.00
       0.293     0.912500        12781        11.43
       0.298     0.925000        12955        13.33
       0.305     0.937500        13129        16.00
       0.309     0.943750        13211        17.78
       0.316     0.950000        13299        20.00
       0.334     0.956250        13389        22.86
      40.703     0.962500        13477        26.67
      40.767     0.968750        13596        32.00
      40.799     0.971875        13665        35.56
      40.799     0.975000        13665        40.00
      40.831     0.978125        13745        45.71
      40.831     0.981250        13745        53.33
      40.863     0.984375        13800        64.00
      40.895     0.985938        13841        71.11
      40.895     0.987500        13841        80.00
      40.927     0.989062        13852        91.43
      43.807     0.990625        13870       106.67
      43.871     0.992188        13908       128.00
      43.871     0.992969        13908       142.22
      43.903     0.993750        13933       160.00
      43.903     0.994531        13933       182.86
      43.903     0.995313        13933       213.33
      43.935     0.996094        13954       256.00
      43.935     0.996484        13954       284.44
      43.967     0.996875        13982       320.00
      43.967     0.997266        13982       365.71
      43.967     0.997656        13982       426.67
      43.967     0.998047        13982       512.00
      43.967     0.998242        13982       568.89
      43.967     0.998437        13982       640.00
      43.967     0.998633        13982       731.43
      43.967     0.998828        13982       853.33
      43.999     0.999023        13991      1024.00
      43.999     0.999121        13991      1137.78
      43.999     0.999219        13991      1280.00
      43.999     0.999316        13991      1462.86
      43.999     0.999414        13991      1706.67
      44.703     0.999512        13992      2048.00
      44.703     0.999561        13992      2275.56
      44.735     0.999609        13993      2560.00
      44.767     0.999658        13995      2925.71
      44.767     0.999707        13995      3413.33
      44.767     0.999756        13995      4096.00
      44.767     0.999780        13995      4551.11
      44.799     0.999805        13998      5120.00
      44.799     1.000000        13998          inf
#[Mean    =        1.913, StdDeviation   =        8.219]
#[Max     =       44.768, Total count    =        13998]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15002 requests in 2.50m, 2.33MB read
Requests/sec:    100.01
Transfer/sec:     15.92KB